# Pyspark Handling Missing Values

- Dropping NaN values
- Dropping Rows
- Various Parameter In Dropping functionalities
- Handling Missing values by Mean, Median And Mode

In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Practice").getOrCreate()

In [2]:
# reading the dataset
df_pyspark = spark.read.csv("test2.csv", header=True, inferSchema=True)
df_pyspark.show()

+------------+----+----------+------+
|        Name| age|Experience|Salary|
+------------+----+----------+------+
|      Younes|  31|        10| 30000|
|      Mourad|  30|         8| 25000|
|Fatima Zahra|  29|         4| 20000|
|     M'hamed|  24|         3| 20000|
|       Fdila|  21|         1| 15000|
|       Hamid|  23|         2| 18000|
|        NULL|NULL|      NULL|  NULL|
|         Ali|NULL|      NULL| 40000|
|        NULL|  34|        10| 38000|
|       Zineb|  36|      NULL|  NULL|
+------------+----+----------+------+

In [3]:
# dropping all the rows that contain at least 1 NULL (how ="any" by default)
df_pyspark.na.drop().show()

+------------+---+----------+------+
|        Name|age|Experience|Salary|
+------------+---+----------+------+
|      Younes| 31|        10| 30000|
|      Mourad| 30|         8| 25000|
|Fatima Zahra| 29|         4| 20000|
|     M'hamed| 24|         3| 20000|
|       Fdila| 21|         1| 15000|
|       Hamid| 23|         2| 18000|
+------------+---+----------+------+

In [4]:
# dropping rows that contain only NULL values
df_pyspark.na.drop(how ="all").show()

+------------+----+----------+------+
|        Name| age|Experience|Salary|
+------------+----+----------+------+
|      Younes|  31|        10| 30000|
|      Mourad|  30|         8| 25000|
|Fatima Zahra|  29|         4| 20000|
|     M'hamed|  24|         3| 20000|
|       Fdila|  21|         1| 15000|
|       Hamid|  23|         2| 18000|
|         Ali|NULL|      NULL| 40000|
|        NULL|  34|        10| 38000|
|       Zineb|  36|      NULL|  NULL|
+------------+----+----------+------+

In [5]:
# Threshold :  drop rows that have less than `thresh` non-null values
df_pyspark.na.drop(thresh=2).show()

+------------+----+----------+------+
|        Name| age|Experience|Salary|
+------------+----+----------+------+
|      Younes|  31|        10| 30000|
|      Mourad|  30|         8| 25000|
|Fatima Zahra|  29|         4| 20000|
|     M'hamed|  24|         3| 20000|
|       Fdila|  21|         1| 15000|
|       Hamid|  23|         2| 18000|
|         Ali|NULL|      NULL| 40000|
|        NULL|  34|        10| 38000|
|       Zineb|  36|      NULL|  NULL|
+------------+----+----------+------+

In [6]:
# subset argument : subset : str, tuple or list, optional optional list of column names to consider.
df_pyspark.na.drop(how='any', subset=['Salary']).show()

+------------+----+----------+------+
|        Name| age|Experience|Salary|
+------------+----+----------+------+
|      Younes|  31|        10| 30000|
|      Mourad|  30|         8| 25000|
|Fatima Zahra|  29|         4| 20000|
|     M'hamed|  24|         3| 20000|
|       Fdila|  21|         1| 15000|
|       Hamid|  23|         2| 18000|
|         Ali|NULL|      NULL| 40000|
|        NULL|  34|        10| 38000|
+------------+----+----------+------+

In [25]:
# filling the missing values
df_pyspark.na.fill({'Name':'Missing Values',
                    'age' : 0}).show()

+--------------+---+----------+------+
|          Name|age|Experience|Salary|
+--------------+---+----------+------+
|        Younes| 31|        10| 30000|
|        Mourad| 30|         8| 25000|
|  Fatima Zahra| 29|         4| 20000|
|       M'hamed| 24|         3| 20000|
|         Fdila| 21|         1| 15000|
|         Hamid| 23|         2| 18000|
|Missing Values|  0|      NULL|  NULL|
|           Ali|  0|      NULL| 40000|
|Missing Values| 34|        10| 38000|
|         Zineb| 36|      NULL|  NULL|
+--------------+---+----------+------+

+------------+----+----------+------+
|        Name| age|Experience|Salary|
+------------+----+----------+------+
|      Younes|  31|        10| 30000|
|      Mourad|  30|         8| 25000|
|Fatima Zahra|  29|         4| 20000|
|     M'hamed|  24|         3| 20000|
|       Fdila|  21|         1| 15000|
|       Hamid|  23|         2| 18000|
|        NULL|NULL|      NULL|  NULL|
|         Ali|NULL|      NULL| 40000|
|        NULL|  34|        10| 38000|
|       Zineb|  36|      NULL|  NULL|
+------------+----+----------+------+

In [29]:
df_pyspark.show()

+------------+----+----------+------+
|        Name| age|Experience|Salary|
+------------+----+----------+------+
|      Younes|  31|        10| 30000|
|      Mourad|  30|         8| 25000|
|Fatima Zahra|  29|         4| 20000|
|     M'hamed|  24|         3| 20000|
|       Fdila|  21|         1| 15000|
|       Hamid|  23|         2| 18000|
|        NULL|NULL|      NULL|  NULL|
|         Ali|NULL|      NULL| 40000|
|        NULL|  34|        10| 38000|
|       Zineb|  36|      NULL|  NULL|
+------------+----+----------+------+

Filling the missing values in acolumn with the mean (or median or mode) value of that column, for that we use an `Imputer` function.

In [45]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['age', 'Experience', 'Salary'], 
    outputCols=["{}_imputed".format(c) for c in ['age', 'Experience', 'Salary']]
    ).setStrategy("mean")

In [46]:
# Add imputation cols to df
imputer.fit(df_pyspark).transform(df_pyspark).show()

+------------+----+----------+------+-----------+------------------+--------------+
|        Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+------------+----+----------+------+-----------+------------------+--------------+
|      Younes|  31|        10| 30000|         31|                10|         30000|
|      Mourad|  30|         8| 25000|         30|                 8|         25000|
|Fatima Zahra|  29|         4| 20000|         29|                 4|         20000|
|     M'hamed|  24|         3| 20000|         24|                 3|         20000|
|       Fdila|  21|         1| 15000|         21|                 1|         15000|
|       Hamid|  23|         2| 18000|         23|                 2|         18000|
|        NULL|NULL|      NULL|  NULL|         28|                 5|         25750|
|         Ali|NULL|      NULL| 40000|         28|                 5|         40000|
|        NULL|  34|        10| 38000|         34|                10|         38000|
|       Zineb|  36|      NULL|  NULL|         36|                 5|         25750|
+------------+----+----------+------+-----------+------------------+--------------+